pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block_ordering.h
//---------------------------------------------------------------------------*
//                                                                           *
//                  File 'pic18_optimize_block_ordering.h'                   *
//                        Generated by version 2.5.0                         *
//                      august 3rd, 2013, at 23h50'7"                        *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#ifndef pic18_optimize_block_ordering_ENTITIES_DEFINED
#define pic18_optimize_block_ordering_ENTITIES_DEFINED

//---------------------------------------------------------------------------*

#include "galgas2/predefined-types.h"

//---------------------------------------------------------------------------*

#include "ipic18_block_representation.h"
#include "pic18_metamodel.h"
#include "generic_metamodel.h"
#include "pic18_mnemonics.h"

//---------------------------------------------------------------------------*

class GALGAS_blockInvocationGraph ;

//---------------------------------------------------------------------------*
//                                                                           *
//                        @blockInvocationGraph graph                        *
//                                                                           *
//---------------------------------------------------------------------------*

class GALGAS_blockInvocationGraph : public AC_GALGAS_graph {
//--------------------------------- Default constructor
  public : GALGAS_blockInvocationGraph (void) ;

//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_blockInvocationGraph extractObject (const GALGAS_object & inObject,
                                                             C_Compiler * inCompiler
                                                             COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_blockInvocationGraph constructor_emptyGraph (LOCATION_ARGS) ;


//--------------------------------- Modifiers
  public : VIRTUAL_IN_DEBUG void modifier_addNode (GALGAS_lstring inArgument0,
                                                   GALGAS_string inArgument1,
                                                   C_Compiler * inCompiler
                                                   COMMA_LOCATION_ARGS) ;


//--------------------------------- Instance Methods
  public : VIRTUAL_IN_DEBUG void method_topologicalSort (GALGAS_stringlist & outArgument0,
                                                         GALGAS_lstringlist & outArgument1,
                                                         GALGAS_stringlist & outArgument2,
                                                         GALGAS_lstringlist & outArgument3,
                                                         C_Compiler * inCompiler
                                                         COMMA_LOCATION_ARGS) const ;

//--------------------------------- Class Methods

//--------------------------------- Readers

//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_blockInvocationGraph class


//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_blockInvocationGraph ;

//---------------------------------------------------------------------------*
//                                                                           *
//                   Routine 'ipic18OptimizeBlockOrdering'                   *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_ipic_31__38_OptimizeBlockOrdering (const GALGAS_string constinArgument0,
                                                GALGAS_string & ioArgument1,
                                                GALGAS_ipic_31__38_BlockList & ioArgument2,
                                                C_Compiler * inCompiler
                                                COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Abstract category method '@ipic18AbstractBlockTerminator buildOrderedBlocks'*
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_buildOrderedBlocks) (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                                GALGAS_blockInvocationGraph & ioArgument0,
                                                                                                GALGAS_stringset & ioArgument1,
                                                                                                const GALGAS_ipic_31__38_BlockList constinArgument2,
                                                                                                const GALGAS_symbolTableForBlockOptimization constinArgument3,
                                                                                                const GALGAS_lstring constinArgument4,
                                                                                                C_Compiler * inCompiler
                                                                                                COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_buildOrderedBlocks (const PMSInt32 inClassIndex,
                                             categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_buildOrderedBlocks inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_buildOrderedBlocks (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                            GALGAS_blockInvocationGraph & io_ioGraph,
                                            GALGAS_stringset & io_ioVisitedBlockSet,
                                            const GALGAS_ipic_31__38_BlockList constin_inBlockList,
                                            const GALGAS_symbolTableForBlockOptimization constin_inSymbolTable,
                                            const GALGAS_lstring constin_inLabelBlock,
                                            C_Compiler * inCompiler
                                            COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Abstract category method '@ipic18AbstractBlockTerminator buildInvocationGraph'*
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_buildInvocationGraph) (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                                  const GALGAS_lstring constinArgument0,
                                                                                                  GALGAS_string & ioArgument1,
                                                                                                  const GALGAS_bool constinArgument2,
                                                                                                  C_Compiler * inCompiler
                                                                                                  COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_buildInvocationGraph (const PMSInt32 inClassIndex,
                                               categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_buildInvocationGraph inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_buildInvocationGraph (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                              const GALGAS_lstring constin_inBlockLabel,
                                              GALGAS_string & io_ioGraphVizString,
                                              const GALGAS_bool constin_inDottedArrow,
                                              C_Compiler * inCompiler
                                              COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@ipic18AbstractBlockTerminator buildOrderingConstraintGraph'*
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_buildOrderingConstraintGraph) (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                                          const GALGAS_ipic_31__38_BlockList constinArgument0,
                                                                                                          const GALGAS_symbolTableForBlockOptimization constinArgument1,
                                                                                                          const GALGAS_lstring constinArgument2,
                                                                                                          const GALGAS_lstring constinArgument3,
                                                                                                          GALGAS_blockInvocationGraph & ioArgument4,
                                                                                                          GALGAS_stringset & ioArgument5,
                                                                                                          C_Compiler * inCompiler
                                                                                                          COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_buildOrderingConstraintGraph (const PMSInt32 inClassIndex,
                                                       categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_buildOrderingConstraintGraph inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_buildOrderingConstraintGraph (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                      const GALGAS_ipic_31__38_BlockList constin_inBlockList,
                                                      const GALGAS_symbolTableForBlockOptimization constin_inSymbolTable,
                                                      const GALGAS_lstring constin_inBlockLabel,
                                                      const GALGAS_lstring constin_inDominatorLabel,
                                                      GALGAS_blockInvocationGraph & io_ioGraph,
                                                      GALGAS_stringset & io_ioVisitedBlockSet,
                                                      C_Compiler * inCompiler
                                                      COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Abstract category reader '@ipic18AbstractBlockTerminator needToInsertJumpInstruction'*
//                                                                           *
//---------------------------------------------------------------------------*

typedef GALGAS_bool (*categoryReaderSignature_ipic_31__38_AbstractBlockTerminator_needToInsertJumpInstruction) (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                                                const GALGAS_string & constinArgument0,
                                                                                                                C_Compiler * inCompiler
                                                                                                                COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryReader_needToInsertJumpInstruction (const PMSInt32 inClassIndex,
                                                      categoryReaderSignature_ipic_31__38_AbstractBlockTerminator_needToInsertJumpInstruction inMethod) ;

//---------------------------------------------------------------------------*

GALGAS_bool callCategoryReader_needToInsertJumpInstruction (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                            const GALGAS_string & constin_inNextBlockLabel,
                                                            C_Compiler * inCompiler
                                                            COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@ipic18AbstractBlockTerminator buildTerminatorCalledRoutineSet'*
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_buildTerminatorCalledRoutineSet) (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                                             GALGAS_stringset & ioArgument0,
                                                                                                             C_Compiler * inCompiler
                                                                                                             COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_buildTerminatorCalledRoutineSet (const PMSInt32 inClassIndex,
                                                          categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_buildTerminatorCalledRoutineSet inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_buildTerminatorCalledRoutineSet (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                         GALGAS_stringset & io_ioReferencedBlockSet,
                                                         C_Compiler * inCompiler
                                                         COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@ipic18SequentialInstruction buildInstructionCalledRoutineSet'*
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_ipic_31__38_SequentialInstruction_buildInstructionCalledRoutineSet) (const cPtr_ipic_31__38_SequentialInstruction * inObject,
                                                                                                            GALGAS_stringset & ioArgument0,
                                                                                                            C_Compiler * inCompiler
                                                                                                            COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_buildInstructionCalledRoutineSet (const PMSInt32 inClassIndex,
                                                           categoryMethodSignature_ipic_31__38_SequentialInstruction_buildInstructionCalledRoutineSet inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_buildInstructionCalledRoutineSet (const cPtr_ipic_31__38_SequentialInstruction * inObject,
                                                          GALGAS_stringset & io_ioReferencedBlockSet,
                                                          C_Compiler * inCompiler
                                                          COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@ipic18SequentialInstructionList buildInstructionCalledRoutineSet'*
//                                                                           *
//---------------------------------------------------------------------------*

void categoryMethod_buildInstructionCalledRoutineSet (const GALGAS_ipic_31__38_SequentialInstructionList inObject,
                                                      GALGAS_stringset & io_ioReferencedBlockSet,
                                                      C_Compiler * inCompiler
                                                      COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//           Category method '@ipic18Block buildCalledRoutineSet'            *
//                                                                           *
//---------------------------------------------------------------------------*

void categoryMethod_buildCalledRoutineSet (const GALGAS_ipic_31__38_Block inObject,
                                           GALGAS_stringset & io_ioReferencedBlockSet,
                                           C_Compiler * inCompiler
                                           COMMA_LOCATION_ARGS) ;

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2

#endif
